app/views/api/users/_user.json.jbuilder

json.image_url asset_path(user.image.url)
json.createdAt user.created_at.to_date
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"